In [89]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sn

In [90]:
df=pd.read_csv('penguins_size.csv')

In [91]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE

In [92]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 344 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            344 non-null    object
 1   island             344 non-null    object
 2   culmen_length_mm   342 non-null    float64
 3   culmen_depth_mm    342 non-null    float64
 4   flipper_length_mm  342 non-null    float64
 5   body_mass_g        342 non-null    float64
 6   sex                334 non-null    object
dtypes: float64(4), object(3)
memory usage: 18.9+ KB

In [93]:
df=df.dropna()

In [94]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 334 entries, 0 to 343
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   species            334 non-null    object
 1   island             334 non-null    object
 2   culmen_length_mm   334 non-null    float64
 3   culmen_depth_mm    334 non-null    float64
 4   flipper_length_mm  334 non-null    float64
 5   body_mass_g        334 non-null    float64
 6   sex                334 non-null    object
dtypes: float64(4), object(3)
memory usage: 20.9+ KB

In [95]:
df.head()

,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE

In [96]:
df.reset_index(inplace=True)

In [97]:
df.head()

,index,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
4,5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE

In [98]:
df['sex'].unique()

array(['MALE', 'FEMALE', '.'], dtype=object)

In [99]:
df.groupby('sex').count()

,index,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g
sex,,,,,,,
.,1,1,1,1,1,1,1
FEMALE,165,165,165,165,165,165,165
MALE,168,168,168,168,168,168,168

In [100]:
df[df['sex']=='.']

,index,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
327,336,Gentoo,Biscoe,44.5,15.7,217.0,4875.0,.

In [101]:
df.groupby('sex').mean()

,index,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g
sex,,,,,
.,336.000000,44.500000,15.700000,217.000000,4875.000000
FEMALE,170.787879,42.096970,16.425455,197.363636,3862.272727
MALE,173.791667,45.854762,17.891071,204.505952,4545.684524

as body mass is more towards male hence dot sex can be classified as male

In [102]:
df.loc[df['sex']=='.']='MALE'

In [103]:
df['sex'].unique()

array(['MALE', 'FEMALE'], dtype=object)

In [104]:
df['newsex']=pd.get_dummies(data=df['sex'],drop_first=True)

In [107]:
df.drop('sex',axis=1).head()

,index,species,island,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,newsex
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,1
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,0
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,0
3,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,0
4,5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,1